feat_bootleneck(
  (bn): BatchNorm1d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (relu): ReLU(inplace=True)
  (dropout): Dropout(p=0.5, inplace=False)
  (bottleneck): Linear(in_features=2048, out_features=256, bias=True)
)